MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J93/mcu.h
extern volatile CCPR1Lbits_t CCPR1Lbits __at(0xF69);
// bitfield macros
#define _CCPR1L_CCPR1L_POSN                                 0x0
#define _CCPR1L_CCPR1L_POSITION                             0x0
#define _CCPR1L_CCPR1L_SIZE                                 0x8
#define _CCPR1L_CCPR1L_LENGTH                               0x8
#define _CCPR1L_CCPR1L_MASK                                 0xFF

// Register: CCPR1H
#define CCPR1H CCPR1H
extern volatile unsigned char           CCPR1H              __at(0xF6A);
#ifndef _LIB_BUILD
asm("CCPR1H equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR1H                 :8;
    };
} CCPR1Hbits_t;
extern volatile CCPR1Hbits_t CCPR1Hbits __at(0xF6A);
// bitfield macros
#define _CCPR1H_CCPR1H_POSN                                 0x0
#define _CCPR1H_CCPR1H_POSITION                             0x0
#define _CCPR1H_CCPR1H_SIZE                                 0x8
#define _CCPR1H_CCPR1H_LENGTH                               0x8
#define _CCPR1H_CCPR1H_MASK                                 0xFF

// Register: LCDDATA6
#define LCDDATA6 LCDDATA6
extern volatile unsigned char           LCDDATA6            __at(0xF6C);
#ifndef _LIB_BUILD
asm("LCDDATA6 equ 0F6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA6               :8;
    };
    struct {
        unsigned S00C1                  :1;
        unsigned S01C1                  :1;
        unsigned S02C1                  :1;
        unsigned S03C1                  :1;
        unsigned S04C1                  :1;
        unsigned S05C1                  :1;
        unsigned S06C1                  :1;
        unsigned S07C1                  :1;
    };
    struct {
        unsigned SEG0COM1               :1;
        unsigned SEG1COM1               :1;
        unsigned SEG2COM1               :1;
        unsigned SEG3COM1               :1;
        unsigned SEG4COM1               :1;
        unsigned SEG5COM1               :1;
        unsigned SEG6COM1               :1;
        unsigned SEG7COM1               :1;
    };
    struct {
        unsigned S0C1                   :1;
        unsigned S1C1                   :1;
        unsigned S2C1                   :1;
        unsigned S3C1                   :1;
        unsigned S4C1                   :1;
        unsigned S5C1                   :1;
        unsigned S6C1                   :1;
        unsigned S7C1                   :1;
    };
} LCDDATA6bits_t;
extern volatile LCDDATA6bits_t LCDDATA6bits __at(0xF6C);
// bitfield macros
#define _LCDDATA6_LCDDATA6_POSN                             0x0
#define _LCDDATA6_LCDDATA6_POSITION                         0x0
#define _LCDDATA6_LCDDATA6_SIZE                             0x8
#define _LCDDATA6_LCDDATA6_LENGTH                           0x8
#define _LCDDATA6_LCDDATA6_MASK                             0xFF
#define _LCDDATA6_S00C1_POSN                                0x0
#define _LCDDATA6_S00C1_POSITION                            0x0
#define _LCDDATA6_S00C1_SIZE                                0x1
#define _LCDDATA6_S00C1_LENGTH                              0x1
#define _LCDDATA6_S00C1_MASK                                0x1
#define _LCDDATA6_S01C1_POSN                                0x1
#define _LCDDATA6_S01C1_POSITION                            0x1
#define _LCDDATA6_S01C1_SIZE                                0x1
#define _LCDDATA6_S01C1_LENGTH                              0x1
#define _LCDDATA6_S01C1_MASK                                0x2
#define _LCDDATA6_S02C1_POSN                                0x2
#define _LCDDATA6_S02C1_POSITION                            0x2
#define _LCDDATA6_S02C1_SIZE                                0x1
#define _LCDDATA6_S02C1_LENGTH                              0x1
#define _LCDDATA6_S02C1_MASK                                0x4
#define _LCDDATA6_S03C1_POSN                                0x3
#define _LCDDATA6_S03C1_POSITION                            0x3
#define _LCDDATA6_S03C1_SIZE                                0x1
#define _LCDDATA6_S03C1_LENGTH                              0x1
#define _LCDDATA6_S03C1_MASK                                0x8
#define _LCDDATA6_S04C1_POSN                                0x4
#define _LCDDATA6_S04C1_POSITION                            0x4
#define _LCDDATA6_S04C1_SIZE                                0x1
#define _LCDDATA6_S04C1_LENGTH                              0x1
#define _LCDDATA6_S04C1_MASK                                0x10
#define _LCDDATA6_S05C1_POSN                                0x5
#define _LCDDATA6_S05C1_POSITION                            0x5
#define _LCDDATA6_S05C1_SIZE                                0x1
#define _LCDDATA6_S05C1_LENGTH                              0x1
#define _LCDDATA6_S05C1_MASK                                0x20
#define _LCDDATA6_S06C1_POSN                                0x6
#define _LCDDATA6_S06C1_POSITION                            0x6
#define _LCDDATA6_S06C1_SIZE                                0x1
#define _LCDDATA6_S06C1_LENGTH                              0x1
#define _LCDDATA6_S06C1_MASK                                0x40
#define _LCDDATA6_S07C1_POSN                                0x7
#define _LCDDATA6_S07C1_POSITION                            0x7
#define _LCDDATA6_S07C1_SIZE                                0x1
#define _LCDDATA6_S07C1_LENGTH                              0x1
#define _LCDDATA6_S07C1_MASK                                0x80
#define _LCDDATA6_SEG0COM1_POSN                             0x0
#define _LCDDATA6_SEG0COM1_POSITION                         0x0
#define _LCDDATA6_SEG0COM1_SIZE                             0x1
#define _LCDDATA6_SEG0COM1_LENGTH                           0x1
#define _LCDDATA6_SEG0COM1_MASK                             0x1
#define _LCDDATA6_SEG1COM1_POSN                             0x1
#define _LCDDATA6_SEG1COM1_POSITION                         0x1
#define _LCDDATA6_SEG1COM1_SIZE                             0x1
#define _LCDDATA6_SEG1COM1_LENGTH                           0x1
#define _LCDDATA6_SEG1COM1_MASK                             0x2
#define _LCDDATA6_SEG2COM1_POSN                             0x2
#define _LCDDATA6_SEG2COM1_POSITION                         0x2
#define _LCDDATA6_SEG2COM1_SIZE                             0x1
#define _LCDDATA6_SEG2COM1_LENGTH                           0x1
#define _LCDDATA6_SEG2COM1_MASK                             0x4
#define _LCDDATA6_SEG3COM1_POSN                             0x3
#define _LCDDATA6_SEG3COM1_POSITION                         0x3
#define _LCDDATA6_SEG3COM1_SIZE                             0x1
#define _LCDDATA6_SEG3COM1_LENGTH                           0x1
#define _LCDDATA6_SEG3COM1_MASK                             0x8
#define _LCDDATA6_SEG4COM1_POSN                             0x4
#define _LCDDATA6_SEG4COM1_POSITION                         0x4
#define _LCDDATA6_SEG4COM1_SIZE                             0x1
#define _LCDDATA6_SEG4COM1_LENGTH                           0x1
#define _LCDDATA6_SEG4COM1_MASK                             0x10
#define _LCDDATA6_SEG5COM1_POSN                             0x5
#define _LCDDATA6_SEG5COM1_POSITION                         0x5
#define _LCDDATA6_SEG5COM1_SIZE                             0x1
#define _LCDDATA6_SEG5COM1_LENGTH                           0x1
#define _LCDDATA6_SEG5COM1_MASK                             0x20
#define _LCDDATA6_SEG6COM1_POSN                             0x6
#define _LCDDATA6_SEG6COM1_POSITION                         0x6
#define _LCDDATA6_SEG6COM1_SIZE                             0x1
#define _LCDDATA6_SEG6COM1_LENGTH                           0x1
#define _LCDDATA6_SEG6COM1_MASK                             0x40
#define _LCDDATA6_SEG7COM1_POSN                             0x7
#define _LCDDATA6_SEG7COM1_POSITION                         0x7
#define _LCDDATA6_SEG7COM1_SIZE                             0x1
#define _LCDDATA6_SEG7COM1_LENGTH                           0x1
#define _LCDDATA6_SEG7COM1_MASK                             0x80
#define _LCDDATA6_S0C1_POSN                                 0x0
#define _LCDDATA6_S0C1_POSITION                             0x0
#define _LCDDATA6_S0C1_SIZE                                 0x1
#define _LCDDATA6_S0C1_LENGTH                               0x1
#define _LCDDATA6_S0C1_MASK                                 0x1
#define _LCDDATA6_S1C1_POSN                                 0x1
#define _LCDDATA6_S1C1_POSITION                             0x1
#define _LCDDATA6_S1C1_SIZE                                 0x1
#define _LCDDATA6_S1C1_LENGTH                               0x1
#define _LCDDATA6_S1C1_MASK                                 0x2
#define _LCDDATA6_S2C1_POSN                                 0x2
#define _LCDDATA6_S2C1_POSITION                             0x2
#define _LCDDATA6_S2C1_SIZE                                 0x1
#define _LCDDATA6_S2C1_LENGTH                               0x1
#define _LCDDATA6_S2C1_MASK                                 0x4
#define _LCDDATA6_S3C1_POSN                                 0x3
#define _LCDDATA6_S3C1_POSITION                             0x3
#define _LCDDATA6_S3C1_SIZE                                 0x1
#define _LCDDATA6_S3C1_LENGTH                               0x1
#define _LCDDATA6_S3C1_MASK                                 0x8
#define _LCDDATA6_S4C1_POSN                                 0x4
#define _LCDDATA6_S4C1_POSITION                             0x4
#define _LCDDATA6_S4C1_SIZE                                 0x1
#define _LCDDATA6_S4C1_LENGTH                               0x1
#define _LCDDATA6_S4C1_MASK                                 0x10
#define _LCDDATA6_S5C1_POSN                                 0x5
#define _LCDDATA6_S5C1_POSITION                             0x5
#define _LCDDATA6_S5C1_SIZE                                 0x1
#define _LCDDATA6_S5C1_LENGTH                               0x1
#define _LCDDATA6_S5C1_MASK                                 0x20
#define _LCDDATA6_S6C1_POSN                                 0x6
#define _LCDDATA6_S6C1_POSITION                             0x6
#define _LCDDATA6_S6C1_SIZE                                 0x1
#define _LCDDATA6_S6C1_LENGTH                               0x1
#define _LCDDATA6_S6C1_MASK                                 0x40
#define _LCDDATA6_S7C1_POSN                                 0x7
#define _LCDDATA6_S7C1_POSITION                             0x7
#define _LCDDATA6_S7C1_SIZE                                 0x1
#define _LCDDATA6_S7C1_LENGTH                               0x1
#define _LCDDATA6_S7C1_MASK                                 0x80

// Register: LCDDATA7
#define LCDDATA7 LCDDATA7
extern volatile unsigned char           LCDDATA7            __at(0xF6D);
#ifndef _LIB_BUILD
asm("LCDDATA7 equ 0F6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA7               :8;
    };
    struct {
        unsigned S8C1                   :1;
        unsigned S9C1                   :1;
        unsigned S10C1                  :1;
        unsigned S11C1                  :1;
        unsigned S12C1                  :1;
        unsigned S13C1                  :1;
        unsigned S14C1                  :1;
        unsigned S15C1                  :1;
    };
    struct {
        unsigned SEG8COM1               :1;
        unsigned SEG9COM1               :1;
        unsigned SEG10COM1              :1;
        unsigned SEG11COM1              :1;
        unsigned SEG12COM1              :1;
        unsigned SEG13COM1              :1;
        unsigned SEG14COM1              :1;
        unsigned SEG15COM1              :1;
    };
    struct {
        unsigned S08C1                  :1;
        unsigned S09C1                  :1;
    };
} LCDDATA7bits_t;
