MikroElektronika/core_packages/PIC/XC8/def/PIC18F67J93/mcu.h
extern volatile LCDDATA2bits_t LCDDATA2bits __at(0xFBD);
// bitfield macros
#define _LCDDATA2_LCDDATA2_POSN                             0x0
#define _LCDDATA2_LCDDATA2_POSITION                         0x0
#define _LCDDATA2_LCDDATA2_SIZE                             0x8
#define _LCDDATA2_LCDDATA2_LENGTH                           0x8
#define _LCDDATA2_LCDDATA2_MASK                             0xFF
#define _LCDDATA2_S16C0_POSN                                0x0
#define _LCDDATA2_S16C0_POSITION                            0x0
#define _LCDDATA2_S16C0_SIZE                                0x1
#define _LCDDATA2_S16C0_LENGTH                              0x1
#define _LCDDATA2_S16C0_MASK                                0x1
#define _LCDDATA2_S17C0_POSN                                0x1
#define _LCDDATA2_S17C0_POSITION                            0x1
#define _LCDDATA2_S17C0_SIZE                                0x1
#define _LCDDATA2_S17C0_LENGTH                              0x1
#define _LCDDATA2_S17C0_MASK                                0x2
#define _LCDDATA2_S18C0_POSN                                0x2
#define _LCDDATA2_S18C0_POSITION                            0x2
#define _LCDDATA2_S18C0_SIZE                                0x1
#define _LCDDATA2_S18C0_LENGTH                              0x1
#define _LCDDATA2_S18C0_MASK                                0x4
#define _LCDDATA2_S19C0_POSN                                0x3
#define _LCDDATA2_S19C0_POSITION                            0x3
#define _LCDDATA2_S19C0_SIZE                                0x1
#define _LCDDATA2_S19C0_LENGTH                              0x1
#define _LCDDATA2_S19C0_MASK                                0x8
#define _LCDDATA2_S20C0_POSN                                0x4
#define _LCDDATA2_S20C0_POSITION                            0x4
#define _LCDDATA2_S20C0_SIZE                                0x1
#define _LCDDATA2_S20C0_LENGTH                              0x1
#define _LCDDATA2_S20C0_MASK                                0x10
#define _LCDDATA2_S21C0_POSN                                0x5
#define _LCDDATA2_S21C0_POSITION                            0x5
#define _LCDDATA2_S21C0_SIZE                                0x1
#define _LCDDATA2_S21C0_LENGTH                              0x1
#define _LCDDATA2_S21C0_MASK                                0x20
#define _LCDDATA2_S22C0_POSN                                0x6
#define _LCDDATA2_S22C0_POSITION                            0x6
#define _LCDDATA2_S22C0_SIZE                                0x1
#define _LCDDATA2_S22C0_LENGTH                              0x1
#define _LCDDATA2_S22C0_MASK                                0x40
#define _LCDDATA2_S23C0_POSN                                0x7
#define _LCDDATA2_S23C0_POSITION                            0x7
#define _LCDDATA2_S23C0_SIZE                                0x1
#define _LCDDATA2_S23C0_LENGTH                              0x1
#define _LCDDATA2_S23C0_MASK                                0x80
#define _LCDDATA2_SEG16COM0_POSN                            0x0
#define _LCDDATA2_SEG16COM0_POSITION                        0x0
#define _LCDDATA2_SEG16COM0_SIZE                            0x1
#define _LCDDATA2_SEG16COM0_LENGTH                          0x1
#define _LCDDATA2_SEG16COM0_MASK                            0x1
#define _LCDDATA2_SEG17COM0_POSN                            0x1
#define _LCDDATA2_SEG17COM0_POSITION                        0x1
#define _LCDDATA2_SEG17COM0_SIZE                            0x1
#define _LCDDATA2_SEG17COM0_LENGTH                          0x1
#define _LCDDATA2_SEG17COM0_MASK                            0x2
#define _LCDDATA2_SEG18COM0_POSN                            0x2
#define _LCDDATA2_SEG18COM0_POSITION                        0x2
#define _LCDDATA2_SEG18COM0_SIZE                            0x1
#define _LCDDATA2_SEG18COM0_LENGTH                          0x1
#define _LCDDATA2_SEG18COM0_MASK                            0x4
#define _LCDDATA2_SEG19COM0_POSN                            0x3
#define _LCDDATA2_SEG19COM0_POSITION                        0x3
#define _LCDDATA2_SEG19COM0_SIZE                            0x1
#define _LCDDATA2_SEG19COM0_LENGTH                          0x1
#define _LCDDATA2_SEG19COM0_MASK                            0x8
#define _LCDDATA2_SEG20COM0_POSN                            0x4
#define _LCDDATA2_SEG20COM0_POSITION                        0x4
#define _LCDDATA2_SEG20COM0_SIZE                            0x1
#define _LCDDATA2_SEG20COM0_LENGTH                          0x1
#define _LCDDATA2_SEG20COM0_MASK                            0x10
#define _LCDDATA2_SEG21COM0_POSN                            0x5
#define _LCDDATA2_SEG21COM0_POSITION                        0x5
#define _LCDDATA2_SEG21COM0_SIZE                            0x1
#define _LCDDATA2_SEG21COM0_LENGTH                          0x1
#define _LCDDATA2_SEG21COM0_MASK                            0x20
#define _LCDDATA2_SEG22COM0_POSN                            0x6
#define _LCDDATA2_SEG22COM0_POSITION                        0x6
#define _LCDDATA2_SEG22COM0_SIZE                            0x1
#define _LCDDATA2_SEG22COM0_LENGTH                          0x1
#define _LCDDATA2_SEG22COM0_MASK                            0x40
#define _LCDDATA2_SEG23COM0_POSN                            0x7
#define _LCDDATA2_SEG23COM0_POSITION                        0x7
#define _LCDDATA2_SEG23COM0_SIZE                            0x1
#define _LCDDATA2_SEG23COM0_LENGTH                          0x1
#define _LCDDATA2_SEG23COM0_MASK                            0x80

// Register: LCDDATA3
#define LCDDATA3 LCDDATA3
extern volatile unsigned char           LCDDATA3            __at(0xFBE);
#ifndef _LIB_BUILD
asm("LCDDATA3 equ 0FBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA3               :8;
    };
    struct {
        unsigned S24C0                  :1;
        unsigned S25C0                  :1;
        unsigned S26C0                  :1;
        unsigned S27C0                  :1;
        unsigned S28C0                  :1;
        unsigned S29C0                  :1;
        unsigned S30C0                  :1;
        unsigned S31C0                  :1;
    };
    struct {
        unsigned SEG24COM0              :1;
        unsigned SEG25COM0              :1;
        unsigned SEG26COM0              :1;
        unsigned SEG27COM0              :1;
        unsigned SEG28COM0              :1;
        unsigned SEG29COM0              :1;
        unsigned SEG30COM0              :1;
        unsigned SEG31COM0              :1;
    };
} LCDDATA3bits_t;
extern volatile LCDDATA3bits_t LCDDATA3bits __at(0xFBE);
// bitfield macros
#define _LCDDATA3_LCDDATA3_POSN                             0x0
#define _LCDDATA3_LCDDATA3_POSITION                         0x0
#define _LCDDATA3_LCDDATA3_SIZE                             0x8
#define _LCDDATA3_LCDDATA3_LENGTH                           0x8
#define _LCDDATA3_LCDDATA3_MASK                             0xFF
#define _LCDDATA3_S24C0_POSN                                0x0
#define _LCDDATA3_S24C0_POSITION                            0x0
#define _LCDDATA3_S24C0_SIZE                                0x1
#define _LCDDATA3_S24C0_LENGTH                              0x1
#define _LCDDATA3_S24C0_MASK                                0x1
#define _LCDDATA3_S25C0_POSN                                0x1
#define _LCDDATA3_S25C0_POSITION                            0x1
#define _LCDDATA3_S25C0_SIZE                                0x1
#define _LCDDATA3_S25C0_LENGTH                              0x1
#define _LCDDATA3_S25C0_MASK                                0x2
#define _LCDDATA3_S26C0_POSN                                0x2
#define _LCDDATA3_S26C0_POSITION                            0x2
#define _LCDDATA3_S26C0_SIZE                                0x1
#define _LCDDATA3_S26C0_LENGTH                              0x1
#define _LCDDATA3_S26C0_MASK                                0x4
#define _LCDDATA3_S27C0_POSN                                0x3
#define _LCDDATA3_S27C0_POSITION                            0x3
#define _LCDDATA3_S27C0_SIZE                                0x1
#define _LCDDATA3_S27C0_LENGTH                              0x1
#define _LCDDATA3_S27C0_MASK                                0x8
#define _LCDDATA3_S28C0_POSN                                0x4
#define _LCDDATA3_S28C0_POSITION                            0x4
#define _LCDDATA3_S28C0_SIZE                                0x1
#define _LCDDATA3_S28C0_LENGTH                              0x1
#define _LCDDATA3_S28C0_MASK                                0x10
#define _LCDDATA3_S29C0_POSN                                0x5
#define _LCDDATA3_S29C0_POSITION                            0x5
#define _LCDDATA3_S29C0_SIZE                                0x1
#define _LCDDATA3_S29C0_LENGTH                              0x1
#define _LCDDATA3_S29C0_MASK                                0x20
#define _LCDDATA3_S30C0_POSN                                0x6
#define _LCDDATA3_S30C0_POSITION                            0x6
#define _LCDDATA3_S30C0_SIZE                                0x1
#define _LCDDATA3_S30C0_LENGTH                              0x1
#define _LCDDATA3_S30C0_MASK                                0x40
#define _LCDDATA3_S31C0_POSN                                0x7
#define _LCDDATA3_S31C0_POSITION                            0x7
#define _LCDDATA3_S31C0_SIZE                                0x1
#define _LCDDATA3_S31C0_LENGTH                              0x1
#define _LCDDATA3_S31C0_MASK                                0x80
#define _LCDDATA3_SEG24COM0_POSN                            0x0
#define _LCDDATA3_SEG24COM0_POSITION                        0x0
#define _LCDDATA3_SEG24COM0_SIZE                            0x1
#define _LCDDATA3_SEG24COM0_LENGTH                          0x1
#define _LCDDATA3_SEG24COM0_MASK                            0x1
#define _LCDDATA3_SEG25COM0_POSN                            0x1
#define _LCDDATA3_SEG25COM0_POSITION                        0x1
#define _LCDDATA3_SEG25COM0_SIZE                            0x1
#define _LCDDATA3_SEG25COM0_LENGTH                          0x1
#define _LCDDATA3_SEG25COM0_MASK                            0x2
#define _LCDDATA3_SEG26COM0_POSN                            0x2
#define _LCDDATA3_SEG26COM0_POSITION                        0x2
#define _LCDDATA3_SEG26COM0_SIZE                            0x1
#define _LCDDATA3_SEG26COM0_LENGTH                          0x1
#define _LCDDATA3_SEG26COM0_MASK                            0x4
#define _LCDDATA3_SEG27COM0_POSN                            0x3
#define _LCDDATA3_SEG27COM0_POSITION                        0x3
#define _LCDDATA3_SEG27COM0_SIZE                            0x1
#define _LCDDATA3_SEG27COM0_LENGTH                          0x1
#define _LCDDATA3_SEG27COM0_MASK                            0x8
#define _LCDDATA3_SEG28COM0_POSN                            0x4
#define _LCDDATA3_SEG28COM0_POSITION                        0x4
#define _LCDDATA3_SEG28COM0_SIZE                            0x1
#define _LCDDATA3_SEG28COM0_LENGTH                          0x1
#define _LCDDATA3_SEG28COM0_MASK                            0x10
#define _LCDDATA3_SEG29COM0_POSN                            0x5
#define _LCDDATA3_SEG29COM0_POSITION                        0x5
#define _LCDDATA3_SEG29COM0_SIZE                            0x1
#define _LCDDATA3_SEG29COM0_LENGTH                          0x1
#define _LCDDATA3_SEG29COM0_MASK                            0x20
#define _LCDDATA3_SEG30COM0_POSN                            0x6
#define _LCDDATA3_SEG30COM0_POSITION                        0x6
#define _LCDDATA3_SEG30COM0_SIZE                            0x1
#define _LCDDATA3_SEG30COM0_LENGTH                          0x1
#define _LCDDATA3_SEG30COM0_MASK                            0x40
#define _LCDDATA3_SEG31COM0_POSN                            0x7
#define _LCDDATA3_SEG31COM0_POSITION                        0x7
#define _LCDDATA3_SEG31COM0_SIZE                            0x1
#define _LCDDATA3_SEG31COM0_LENGTH                          0x1
#define _LCDDATA3_SEG31COM0_MASK                            0x80

